#+STARTUP: showall

#+TITLE:     Class 11: ipython and matplotlib
#+AUTHOR:    Kurt Schwehr
#+EMAIL:     schwehr@ccom.unh.edu
#+DATE:      <2011-10-04 Tue>
#+DESCRIPTION: Marine Research Data Manipulation and Practices
#+KEYWORDS: ipython matplotlib
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:nil skip:t d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+LINK_HOME: http://vislab-ccom.unh.edu/~schwehr/Classes/2011/esci895-researchtools/

** Examples with org-babel and ipython                     :orgbabel:ipython:

Here we are faced with a little problem before we go on.  I would like
the examples to be runnable both in org-mode with =C-c C-c= and as
something you can paste into ipython without modification.  However,
that is not possible.  The setup for python in org-babel is that it
ignores what we will print.  So if I try a print statement in python
and run it with org-babel:

#+BEGIN_SRC python
print 1
#+END_SRC

#+results:
: None

The results above are "None".  Say what?!?!  It turns out that we have
to "return" what we want org-babel to print.

#+BEGIN_SRC python
return 1
#+END_SRC

#+results:
: 1

That is more like what we wanted.  If you just paste the text without
the return, all will be well.  So, in ipython, it will look like this:

#+BEGIN_EXAMPLE 
ipython
Python 2.7.1+ (r271:86832, Apr 11 2011, 18:05:24) 
Type "copyright", "credits" or "license" for more information.

IPython 0.10.1 -- An enhanced Interactive Python.
?         -> Introduction and overview of IPython's features.
%quickref -> Quick reference.
help      -> Python's own help system.
object?   -> Details about 'object'. ?object also works, ?? prints more.

In [1]: 1
Out[1]: 1
#+END_EXAMPLE

** Time to try some actual python!  Playing with strings             :string:

Onwards to working with some strings!  The python documentation is
here:

http://docs.python.org/library/string.html

Strings can be 'in single quotes' or "in double quotes".  I will stick
with singles quotes.

First just a basic string:

#+BEGIN_SRC python
return 'this is a string'
#+END_SRC

#+results:
: this is a string

We can ask python to manipulate a string a little bit:

#+BEGIN_SRC python
return 'this is a string'.capitalize()
#+END_SRC

#+results:
: This is a string

Or we can get fancier.  The title method for a string makes it have
each word capitialized.

#+BEGIN_SRC python
return 'this is a string'.title()
#+END_SRC

#+results:
: This Is A String

We can add strings together.

#+BEGIN_SRC python
return 'this ' + 'is ' + 'a string'
#+END_SRC

#+results:
: this is a string


